# Fictional Army - Filtering and Sorting

In [1]:
#Import the necessary libraries
import pandas as pd

In [2]:
#This is the data given as a dictionary
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [5]:
#Create a dataframe and assign it to a variable called army.
army=pd.DataFrame(raw_data)

In [7]:
#Set the 'origin' colum as the index of the dataframe
army.set_index('origin').head(2)

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24

In [9]:
#Print only the column veterans
army['veterans'].head(2)

0    1
1    5
Name: veterans, dtype: int64

In [11]:
#Print the columns 'veterans' and 'deaths'
army[['veterans','deaths']].head(2)

   veterans  deaths
0         1     523
1         5      52

In [12]:
#Print the name of all the columns
army.columns

Index(['regiment', 'company', 'deaths', 'battles', 'size', 'veterans',
       'readiness', 'armored', 'deserters', 'origin'],
      dtype='object')

In [13]:
#Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska
army.query('origin=="Maine" or origin=="Alaska"')
                          [['deaths','size','deserters']]

   deaths  size  deserters
4      43  1592          3
6     523   987         24

In [ ]:
#Select the rows 3 to 7 and the columns 3 to 6
army.iloc[3:8,3:7]

In [ ]:
#Select every row after the fourth row and all columns
army.iloc[4:]

In [ ]:
#Select every row up to the 4th row and all columns
army.iloc[:5,]
#army.iloc[0:5]

In [19]:
#Select the 3rd column up to the 7th column
army.iloc[:,3:8].head(2)

   battles  size  veterans  readiness  armored
0        5  1045         1          1        1
1       42   957         5          2        0

In [22]:
#Select rows where df.deaths is greater than 50
army[army['deaths']>50].head(2)

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California

In [25]:
#Select rows where df.deaths is greater than 500 or less than 50
army[(army['deaths']>500) | (army['deaths']<50)].head(2)

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas

In [28]:
#Select the rows called Texas and Arizona
army.query('origin=="Texas" or origin=="Arizona"').head(2)

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas

In [33]:
army.head(2)

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California

In [34]:
#Select the third cell in the row named Arizona
army.query('origin=="Arizona"').iloc[:,3]
#army.query('origin=="Arizona"')['battles']

0    5
Name: battles, dtype: int64

In [37]:
#Select the third cell down in the column named deaths
army['deaths'].iloc[3]

616